# Development tools
brew "git"
brew "ghq"
brew "stow"
brew "zsh"
brew "neovim"
brew "tmux"

# Core utilities
brew "parallel"
brew "coreutils"
brew "findutils"
brew "grep"
brew "gnu-sed"

# Version managers
brew "asdf"
brew "direnv"

# Git tools
brew "gh"
brew "git-extras"
brew "git-delta"
brew "git-secret"
brew "git-crypt"
brew "gitmux"
brew "gitleaks"
brew "prek"

# System monitoring
brew "htop"
brew "bottom"

# Data processing
brew "jq"
brew "python-yq"
brew "jless"
brew "miller"
brew "jd"

# Utilities
brew "urlview"
brew "pv"

# File watching
brew "watch"
brew "fswatch"

# Navigation
brew "zoxide"
brew "fzf"

# Image processing
brew "imagemagick"
brew "pngquant"
brew "tesseract"

# Modern CLI tools
brew "starship"
brew "ripgrep"
brew "fd"
brew "bat"
brew "dust"
brew "procs"

# Network tools
brew "iftop"
brew "tcptraceroute"
brew "mtr"
brew "telnet"
brew "nmap"

# Benchmarking
brew "hyperfine"
brew "gnu-units"

# Security
brew "ykman"
brew "gnupg"
brew "pwgen"
brew "mkcert"
brew "sops"

# Fun
brew "fortune"

# Container tools
brew "docker"
brew "colima"
brew "dive"

# Programming languages & tools
brew "ansible"
brew "delve"
brew "luarocks"
brew "rustup"
brew "cargo-watch"
brew "cargo-llvm-cov"
brew "cargo-geiger"
brew "cargo-bloat"
brew "cargo-nextest"
brew "pkg-config"
brew "uv"

# Recording
brew "asciinema"
brew "agg"

# Audio/networking
brew "websocat"
brew "sox"
brew "whisper-cpp"

# Kubernetes
brew "helm"
brew "kubectl"
brew "kubeseal"
brew "kubectx"
brew "k3d"
brew "k9s"

# Cloud
brew "azure-cli"

# Fonts
cask "font-sauce-code-pro-nerd-font"

# System utilities
cask "karabiner-elements"
cask "hammerspoon"

# Terminal
cask "alacritty"

# Productivity
cask "obsidian"

# Communication
cask "signal"
cask "discord"

# Security & Privacy
cask "mullvad-vpn"

# 3D Printing & Design
cask "orcaslicer"
cask "blender"

# Media
cask "spotify"

# Distributed storage
cask "ipfs-desktop"

# Browsers
cask "firefox@developer-edition"

# Sync
brew "syncthing"
cask "google-drive"
